TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_СРПВРегистрацияОперацииСВагоном/гкс_СРПВРегистрацияОперацииСВагоном.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_СРПВРегистрацияОперацииСВагоном</name>
  <attributes>
    <name>ИдентификаторОтправки</name>
    <comment>WagonDispatchID</comment>
    <type>
      <types>CatalogRef.гкс_КлючиАналитикиСРПВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.гкс_СРПВТипыОперацийСВагоном</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Путь</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СостоянияРегистрации/гкс_СостоянияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СостоянияРегистрации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.гкс_СостоянияРегистрации</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СРПВСтатусыОформленияВагонов/гкс_СРПВСтатусыОформленияВагонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СРПВСтатусыОформленияВагонов</name>
  <resources>
    <name>Документ</name>
    <type>
      <types>DocumentRef.гкс_Взвешивание</types>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерВагона</name>
    <type>
      <types>DefinedType.гкс_НомерВагона</types>
    </type>
  </attributes>
  <attributes>
    <name>Оформлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>КлючАналитикиСРПВ</name>
    <type>
      <types>CatalogRef.гкс_КлючиАналитикиСРПВ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DefinedType.гкс_ДокументыСРПВ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.гкс_СРПВСтатусыВагонов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СРПВСтатусыВагонов/гкс_СРПВСтатусыВагонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СРПВСтатусыВагонов</name>
  <enumValues>
    <name>Прибыл</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенБрутто</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенТара</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>Погружен</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СРПВТипыОперацийСВагоном/гкс_СРПВТипыОперацийСВагоном.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СРПВТипыОперацийСВагоном</name>
  <enumValues>
    <name>Отправление</name>
  </enumValues>
  <enumValues>
    <name>Прибытие</name>
  </enumValues>
  <enumValues>
    <name>Погрузка</name>
  </enumValues>
  <enumValues>
    <name>Разгрузка</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипРегистрации/гкс_ТипРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипРегистрации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияРегистрации/гкс_СостоянияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияРегистрации</name>
  <enumValues>
    <name>Прибыл</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенБрутто</name>
  </enumValues>
  <enumValues>
    <name>НеПринятоПоПревышениюМаксимальногоВеса</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтборуПроб</name>
  </enumValues>
  <enumValues>
    <name>ВзятыПробы</name>
  </enumValues>
  <enumValues>
    <name>РезультатыПробПолучены</name>
  </enumValues>
  <enumValues>
    <name>КачествоПринято</name>
  </enumValues>
  <enumValues>
    <name>КачествоНеПринято</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаРазрешена</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенТара</name>
  </enumValues>
  <enumValues>
    <name>Убыл</name>
  </enumValues>
  <enumValues>
    <name>НеПринято</name>
  </enumValues>
  <enumValues>
    <name>ПринятыПробы</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаРазрешена</name>
    <comment>ERP-2029</comment>
  </enumValues>
  <enumValues>
    <name>Погружен</name>
    <comment>ERP-2029</comment>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_НаправлениеНаРазгрузку/гкс_НаправлениеНаРазгрузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_НаправлениеНаРазгрузку</name>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервичныйСтатус</name>
    <type>
      <types>EnumRef.гкс_СостоянияРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятьКачество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯмаРазгрузки</name>
    <comment>ERP-1094</comment>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СлужебнаяНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеМестаРазгрузки</name>
    <attributes>
      <name>Силос</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>СлужебнаяНоменклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяРазгрузка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯмаРазгрузки</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_КлючиАналитикиСРПВ/гкс_КлючиАналитикиСРПВ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_КлючиАналитикиСРПВ</name>
  <attributes>
    <name>НомерВагона</name>
    <type>
      <types>DefinedType.гкс_НомерВагона</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОтправкиВагона</name>
    <type>
      <types>DefinedType.гкс_WagonDispatchID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПЛК</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_СРПВРегистрацияОперацииСВагоном/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Изменяет состояние регистрации на ПЛК на  "Выгружен".
//
// Параметры:
//  Статус  - ПеречислениеСсылка.гкс_СРПВСтатусыВагонов - статус взвешивания по СРПВ
//	
Процедура СформироватьДокументПЛКПриНеобходимости(Статус) Экспорт
	
	Если Статус <> Перечисления.гкс_СРПВСтатусыВагонов.Выгружен Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипОперации = Перечисления.гкс_СРПВТипыОперацийСВагоном.Погрузка
		Или гкс_УчетВагоновСРПВ.НаСтатусОформленДокументОперации(ИдентификаторОтправки, Статус) Тогда
		
		Возврат;
	КонецЕсли;
	
	Если Не гкс_УчетВагоновСРПВ.НаСтатусОформленДокументОперации(ИдентификаторОтправки,
		Перечисления.гкс_СРПВСтатусыВагонов.ВзвешенБрутто) Тогда
		Возврат;
	КонецЕсли;
	
	СостоянияРегистрации = РегистрыСведений.гкс_СостоянияРегистрации;
	
    ДанныеОформленияРегистрации = гкс_УчетВагоновСРПВ.ДанныеОформленногоДокументаОперацииПоСтатусу(
									ИдентификаторОтправки, Перечисления.гкс_СРПВСтатусыВагонов.Прибыл);

	ДокументРегистрации = ДанныеОформленияРегистрации.Документ;
	
	СформироватьНаправлениеНаРазгрузкуПриНеобходимости(ДокументРегистрации);
	
	ТекущееСостояниеРегистрации = СостоянияРегистрации.ТекущееСостояниеРегистрации(
		Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт, 
		ДокументРегистрации, 
		Перечисления.гкс_ТипРегистрации.Приемка);
	
	Если гкс_УчетВагоновСРПВ.НаСтатусОформленДокументОперации(ИдентификаторОтправки, 
		Перечисления.гкс_СРПВСтатусыВагонов.ВзвешенБрутто) 
		И (ТекущееСостояниеРегистрации = Перечисления.гкс_СостоянияРегистрации.ВыгрузкаРазрешена) Тогда
		
		НовоеСостояние = Перечисления.гкс_СостоянияРегистрации.Выгружен;
		Комментарий = "";
		гкс_ПриемкаТранспорта.ЗарегистрироватьНовоеСостояние(ДокументРегистрации, НовоеСостояние, Комментарий);
		
		РегистрыСведений.гкс_СРПВСтатусыОформленияВагонов
			.ОтразитьСвязьСДокументомСРПВ(ИдентификаторОтправки, Статус, ДокументРегистрации);

	КонецЕсли;
				
КонецПроцедуры

#КонецОбласти
		
#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	ИдентификаторОтправки = Справочники.гкс_КлючиАналитикиСРПВ.ПустаяСсылка();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	гкс_ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеРеквизитовПоТипуОперации();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
			
	гкс_ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ОперацияПоДокументуОтражена() Тогда 
	
		ДопПараметры = гкс_ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
		ИнициализироватьДопПараметры(ДопПараметры);
		
		гкс_ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ, ДопПараметры);
		
	КонецЕсли;
	
	СформироватьДокументПЛКПриНеобходимости(Перечисления.гкс_СРПВСтатусыВагонов.Выгружен);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	гкс_ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДопПараметры(ДопПараметры)
	ДопПараметры.ДополнительныеСвойства = Новый Структура;
КонецПроцедуры

#КонецОбласти

// Метод проверяет наличие записи в регистре Статусов оформления вагонов СРПВ для документа.
// Если запись найдена, то в журнале регистрации фиксируется предупреждение.
// 
// Возвращаемое значение:
//  Булево - Истина - запись найдена, в противном случае - Ложь
Функция ОперацияПоДокументуОтражена()
	
	Отказ = Ложь;
	Если гкс_УчетВагоновСРПВ.НаВагонОформленДокументОперации(ИдентификаторОтправки, Ссылка) Тогда
		
		Отказ = Истина;
		ТекстПредупреждения = СтрШаблон(НСтр(
			"ru = 'Документ записан без проведения, т.к. на данный вагон уже оформлен документ операции.
				  |Идентификатор отправки: %1'"),
			ИдентификаторОтправки);
		ЗаписьЖурналаРегистрации("Интеграция СРПВ. Документы", 
			УровеньЖурналаРегистрации.Предупреждение, Метаданные(), Ссылка, ТекстПредупреждения);
		
	КонецЕсли;

	Возврат Отказ;
	
КонецФункции

Процедура ПроверитьЗаполнениеРеквизитовПоТипуОперации()
	
	Если ТипОперации = Перечисления.гкс_СРПВТипыОперацийСВагоном.Разгрузка Тогда 
		
		Если Путь.Пустая() Тогда 
		
			ТекстСообщения =
				НСтр("ru = 'Не заполнен путь! Проверьте наличие записи в регистре соответствия объектов СРПВ.'");
			
		ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Путь, "ТочкаМаршрута").Пустая() Тогда 
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Для пути %1 не задана точка маршрута! Заполните реквизит в структуре ПЛК.'"), Путь);
			
		Иначе
			ТекстСообщения = "";
		КонецЕсли;
		
		Если Не ПустаяСтрока(ТекстСообщения) Тогда 
			ЧастиСообщения = Новый Массив;
			ЧастиСообщения.Добавить(ТекстСообщения);
			ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru = 'Идентификатор отправки: %1'"), ИдентификаторОтправки));
			ВызватьИсключение СтрСоединить(ЧастиСообщения, Символы.ПС);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьНаправлениеНаРазгрузкуПриНеобходимости(ДокументРегистрации)
	
	Если Не ТипОперации = Перечисления.гкс_СРПВТипыОперацийСВагоном.Разгрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЯмаРазгрузки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Путь, "ТочкаМаршрута");
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ДокументРегистрации", ДокументРегистрации);
	// Вагон уже разгружен, разрешенные места передавать не нужно
	ДанныеЗаполнения.Вставить("НеРегистрироватьДляПередачиСРПВ");
	
	РеквизитыРегистрации = "ВидПеревозки, ТипРегистрации, Номенклатура, ТочкаМаршрута, Организация";
	ДанныеРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРегистрации, РеквизитыРегистрации);
	ДанныеРегистрации.Вставить("ЯмаРазгрузки", ЯмаРазгрузки); // Добавить в коллекцию для дальнейшего получения настроек
	НаправлениеНаРазгрузку = Документы.гкс_НаправлениеНаРазгрузку.ПолучитьПоРегистрации(ДокументРегистрации);
	Если ЗначениеЗаполнено(НаправлениеНаРазгрузку) Тогда
		
		ДанныеНаправления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			НаправлениеНаРазгрузку, "Дата,СлужебнаяНоменклатура");
		ДанныеЗаполнения.Вставить("ПометкаУдаления", Ложь);
		ДанныеЗаполнения.Вставить("Дата", ДанныеНаправления.Дата);
		// Если направление уже есть, то не обновлять по полученным настройкам
		ДанныеЗаполнения.Вставить("СлужебнаяНоменклатура", ДанныеНаправления.СлужебнаяНоменклатура);
		
	Иначе 
		
		МестнаяДата = Справочники.гкс_ТочкиМаршрута.ПолучитьМестнуюДатуПоТочкеМаршрута(
			ТочкаМаршрута);
		
		// Дату документа нужно уменьшить для того, чтобы не терять запись в РС.гкс_СостоянияРегистрации.
		// Направление на разгрузку сделает запись с Состоянием = Выгрузка разрешена, а затем
		// Операция с вагоном сделает запись в том же разрезе, но с Состоянием = Выгружен.
		// Т.к. регистр имеет периодичность В пределах секунды, то первая запись будет затерта.
		ДанныеЗаполнения.Вставить("Дата", ТекущаяДатаСеанса() - 1);
		ДанныеЗаполнения.Вставить("МестнаяДата", МестнаяДата);
		ДанныеЗаполнения.Вставить("Организация", ДанныеРегистрации.Организация);
		ДанныеЗаполнения.Вставить("ТочкаМаршрута", ТочкаМаршрута);
		ДанныеЗаполнения.Вставить("ПервичныйСтатус", Перечисления.гкс_СостоянияРегистрации.КачествоПринято);
		ДанныеЗаполнения.Вставить("ПринятьКачество", Истина);
		ДанныеЗаполнения.Вставить("Комментарий", "Качество принято по факту разгрузки");
		
	КонецЕсли;
	
	НастройкиРазгрузки = НастройкиРазгрузкиПоЯмеРазгрузки(ДанныеЗаполнения, ДанныеРегистрации);
	Если НастройкиРазгрузки = Неопределено Тогда 
		Возврат; 
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеЗаполнения, НастройкиРазгрузки, Ложь);
	
	Документы.гкс_НаправлениеНаРазгрузку.СоздатьИзменитьИзАРМПриемки(
		ДанныеЗаполнения, ЗначениеЗаполнено(НаправлениеНаРазгрузку), НаправлениеНаРазгрузку);
		
КонецПроцедуры

Функция НастройкиРазгрузкиПоЯмеРазгрузки(ДанныеЗаполнения, ДанныеРегистрации)
	
	НастройкиРазгрузкиПоЯмеРазгрузки = гкс_ПриемкаТранспорта.НастройкиРазгрузкиПоЯмеРазгрузки(
		ДанныеЗаполнения.Дата,
		ДанныеРегистрации.ТочкаМаршрута, 
		ДанныеРегистрации.ВидПеревозки, 
		ДанныеРегистрации.Номенклатура, 
		ДанныеРегистрации.ЯмаРазгрузки);
	
	Если Не НастройкиРазгрузкиПоЯмеРазгрузки.Количество() = 1 Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось однозначно определить настройки разгрузки для ямы %1'"),
			ДанныеРегистрации.ЯмаРазгрузки);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Интеграция СРПВ.Формирование направлений на разгрузку'"),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные(),
			Ссылка,
			ТекстСообщения);
		НастройкиРазгрузки = Неопределено;
	Иначе
		НастройкиРазгрузки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(НастройкиРазгрузкиПоЯмеРазгрузки[0]);
		// Адаптация для документа НаправлениеНаРазгрузку
		НастройкиРазгрузки.Вставить("Склад", НастройкиРазгрузки.Силос);
	КонецЕсли;
	
	Возврат НастройкиРазгрузки;

КонецФункции

#КонецОбласти

#КонецЕсли
